INSERT INTO transport (transport_name, transport_longitude, transport_latitude, seats)
values ('LIAZ4450', 37.55946572661742, 55.696239928979296, 50),
       ('LIAZ4230', 37.60914828794898, 55.76168589497363, 40),
       ('LIAZ7250', 37.60021945891799, 55.7425776394189, 30);

INSERT INTO bus_stop (bus_stop_name,bus_stop_latitude,bus_stop_longitude) VALUES 
('Ленинский проспект',55.708763122558594,37.58293914794922)
,('МТИ',55.7041130065918,37.57329559326172)
,('РГУ НИУ',55.691890716552734,37.551815032958984)
,('Институт гос. адм.',55.68183517456055,37.53599166870117)
,('ул. Кравченко',55.67384719848633,37.524131774902344)
,('Музей Пушкина',55.746803283691406,37.60662078857422)
,('метро Кропоткинская',55.74526596069336,37.60347366333008)
,('храм Христа Спасителя',55.745365142822266,37.60430145263672)
,('Галерея Ильи Глазунова',55.74650955200195,37.60641098022461)
,('Красные Палаты',55.743717193603516,37.601402282714844)
,('посольство Хорватии',55.74060821533203,37.597591400146484)
,('м. Охотный ряд',55.75712203979492,37.615169525146484)
,('Театр им. Ермоловой',55.75825881958008,37.612579345703125)
,('Мин. науки и обр.',55.760902404785156,37.60996627807617)
,('м. Пушкинская',55.76493453979492,37.60477828979492)
;

INSERT INTO route (route_number,bus_stop_list) VALUES 
('470к',' 1 4 3 2 5')
,('347',' 7 10 11 8 9 6')
,('590а',' 12 13 14 15')
;

INSERT INTO passenger_stream (bus_stop_id, transport_id, in_count, out_count)
values (1, 1, 20, 0),
       (2, 1, 15, 14),
       (3, 1, 17, 10),
       (2, 2, 8, 3);

INSERT INTO validation (card_id, date, bus_stop_id, transport_id, route_id)
VALUES ('1234123412341234', '2019-05-18 22:23:21.764000', 3, 1, 1),
       ('0000000000000002', '2019-06-18 12:23:21.764000', 1, 1, 1),
       ('0000000000000002', '2019-06-21 08:00:32.764000', 14, 2, 3),
       ('0000000000000002', '2019-03-07 16:12:03.764000', 8, 3, 2);


